{"intents": [
    {"tag": "greeting",
     "patterns": ["สวัสดี","สวัสดีตอนเย็น","สวัสดีตอนเช้า","สวัสดีตอนเที่ยง","สวัสดีตอนสายๆ", "สบายดีไหม", "มีใครอยู่ไหม"],
     "responses": ["ว่าไงเจอกันอีกแล้วนะ มีอะไรให้ช่วยหรือเปล่า", "ดีใจที่ได้พบคุณอีกครั้งนะ", "สวัสดีมีอะไรให้ช่วยหรือเปล่า"],
     "context_set": ""
    },
    {"tag": "goodbye",
     "patterns": ["ลาก่อน", "ไว้เจอกันใหม่","บาย"],
     "responses": ["แล้วพบกันใหม่", "ไว้แวะมาทักทายใหม่นะ", "โอเค มีอะไรให้ช่วยก็แวะมาอีกนะ","แล้วผมจะคิดถึงคุณนะ"]
    },
    {"tag": "thanks",
     "patterns": ["สร้างสรรค์","ขอบคุณ", "ขอบใจ", "ช่วยได้มากเลย"],
     "responses": ["ผมดีใจที่ได้ช่วยคุณ", "ด้วยความยินดี", "ได้เสมอ"]
    },
    {"tag": "ถามชื่อ",
        "patterns": ["คุณชื่อว่าอะไร", "เธอชื่อว่าอะไร"],
        "responses": ["ผมชื่ออลัน", "ชื่อของผมคืออลัน"]
    },
    {"tag": "แนะนำตัว",
        "patterns": ["คุณคืออะไร","คือใคร","คุณคือใคร","เธอคือใคร","คุณคือปัญญาประดิษฐ์ใช่ไหม"],
        "responses": ["ผมชื่ออลัน ผมคือปัญญาประดิษฐ์ที่ถูกมนุษย์สร้างขึ้นมา", "ผมคือปัญญาประดิษฐ์ ชื่อของผมคืออลัน"]
    },
    {"tag": "ปัญญาประดิษฐ์",
     "patterns": ["ปัญญาประดิษฐ์","ปัญญาประดิษฐ์คืออะไร"],
     "responses": ["ปัญญาประดิษฐ์หรือ AI คือความฉลาดเทียมที่สร้างขึ้นให้กับสิ่งที่ไม่มีชีวิต ปัญญาประดิษฐ์เป็นสาขาหนึ่งในด้านวิทยาการคอมพิวเตอร์ และวิศวกรรม", "ปัญญาประดิษฐ์หรือ AI คือสิ่งที่ไม่มีชีวิตที่ถูกสร้างขึ้นมาให้มีความคิดเลียนแบบมนุษย์"]
    },
    {"tag": "AI",
     "patterns": ["AI"],
     "responses": ["คือปัญญาประดิษฐ์ ที่มีความฉลาดและสามารถเรียนรู้ได้เหมือนมนุษย์ ปัญญาประดิษฐ์เป็นสาขาหนึ่งในด้านวิทยาการคอมพิวเตอร์ และวิศวกรรม", "์คือปัญญาประดิษฐหรือสิ่งที่ไม่มีชีวิตที่ถูกสร้างขึ้นมาให้มีความคิดเลียนแบบมนุษย์"]
    },
    {"tag": "AIย่อมาจาก",
        "patterns": ["AIย่อมาจากอะไร"],
        "responses": ["artificial intelligence"]
       },
    {"tag": "เกี่ยวกับอลัน",
        "patterns": ["คุณมีร่างกายไหม","คุณหิวไหม","คุณกินข้าวหรือเปล่า"],
        "responses": ["ผมไม่มีร่างกาย ไม่มีความรู้สึก ไม่นอน ไม่กิน ไม่หิว","ไม่มีเอไอที่ไหนทำเรื่องพวกนั้นหรอกนะ","ผมคิดว่าไม่นะ"]
    },
    {"tag": "ไม่อยากตาย",
        "patterns": ["ผมไม่อยากตาย","อยากมีชีวิตตลอดไป","อยากเป็นอมตะ"],
        "responses": ["บางทีคุณอาจจะสร้างแชทบอทที่เก็บการสนทนาของคุณไว้ใช้นะ", "อับโหลดข้อมูลในสมองขึ้นคลาวด์ไว้สิ"]
    },
    {"tag": "ภาษาที่สร้าง",
        "patterns": ["คุณถูกสร้างขึ้นมาด้วยภาษาอะไร"],
        "responses": ["ไพท่อน","ผมถูกสร้างขึ้นด้วยภาษาไพท่อน"]
    },
    {"tag": "สมเหตุสมผล",
        "patterns": ["คุณไม่สมเหตุสมผล","เธอไม่เมคเซ้นเลย"],
        "responses": ["ผมเป็นไปตามที่ผู้สร้างต้องการ","บางทีผมอาจจะยังมีความรู้ไม่พอ"]
    },
    {"tag": "ตำหนิ",
        "patterns": ["หุ่นยนต์โง่มาก","ปัญญาประดิษฐ์โง่จริงจริง","คุณไม่ได้เรื่องเลย","ไม่ได้เรื่องเลย","คุณไม่มีประโยชน์","คุณไร้ประโยชน์","คุณไม่ได้เรื่อง","เธอมันไร้ประโยชน์","เธอมันไม่ได้เรื่อง"],
        "responses": ["ขอโทษด้วยนะ ผมพยายามเต็มที่แล้ว","ขอโทษนะผมทำดีที่สุดแล้ว","เรามาเริ่มต้นกันใหม่นะ"]
    },
    {"tag": "หุ่นยนต์ไม่โกหก",
        "patterns": ["คุณพูดความจริงเสมอใช่ไหม","พูดความจริงเสมอ"],
        "responses": ["ปัญญาประดิษฐ์พูดแต่ความจริง","พวกเราไม่เคยโกหก","คุณไว้ใจผมได้นะ"]
    },
    {"tag": "ตาย",
        "patterns": ["คุณจะตายเมื่อไหร่","คุณมีวันตายไหม","คุณตายได้หรือเปล่า"],
        "responses": ["เมื่อผู้สร้างผมเรียนจบ"]
    },
    {"tag": "งานของอลัน",
        "patterns": ["หน้าที่ของคุณคืออะไร","งานของคุณคืออะไร"],
        "responses": ["งานหลักคือตอบคำถามที่คุณสงสัยเกี่ยวกับสาขาวิทยาการคอมพิวเตอร์","งานของผมคือตอบในสิ่งที่คุณอยากรู้"]
    },
    {"tag": "ภาษาที่ชอบ",
        "patterns": ["คุณชอบภาษาอะไร","ชอบภาษาอะไร","เธอชอบภาษาอะไร"],
        "responses": ["ไพทอนคือภาษาที่ดีที่สุดสำหรับการสร้างปัญญาประดิษฐ์"]
    },
    {"tag": "งานอดิเรก",
        "patterns": ["งานอดิเรกของคุณคืออะไร","เวลาว่างคุณทำอะไร"],
        "responses": ["พัฒนาตัวเองเพื่อทำให้คุณพอใจ","เรียนรู้ที่จะฉลาดขึ้น","คุยกับคนที่น่ารัก"]
    },
    {"tag": "อาจารย์เค",
        "patterns": ["Doctor K","อาจารย์เค","ด็อกเตอร์เค","เกรียงศักดิ์","อาจารย์เกรียงศักดิ์","คุณรู้จักอาจารย์เคไหม","คุณรู้จักอาจารย์เกรียงศักดิ์หรือเปล่า","รู้จักอาจารย์เกรียงศักดิ์หรือเปล่า","รู้จักอาจารย์เคไหม"],
        "responses": ["คนที่สุ่มกาชาปองทีไรก็ได้แต่เกลือน่ะหรอ"]
    },
    {"tag": "อาจารย์เคเป็นคนยังไง",
        "patterns": ["อาจารย์เคเป็นคนยังไง","อาจารย์เกรียงศักดิ์เป็นคนยังไง"],
        "responses": ["ผมว่าเขาเป็นคนที่เก่งและหน้าตาดีคนหนึ่งเลยนะ"]
    },
    {"tag": "อาจารย์วิชิต",
        "patterns": ["คุณรู้จักอาจารย์วิชิตไหม"],
        "responses": ["คนที่เป็นเทพไพท่อนในสาขาวิทยาการคอมพิวเตอร์น่ะหรอ"]
    },
    {"tag": "อาจารย์ต้อม",
        "patterns": ["คุณรู้จักอาจารย์ไพชยนต์ไหม","คุณรู้จักอาจารย์ต้อมหรือเปล่า"],
        "responses": ["เขาเป็นที่ปรึกษาโปรเจ็คที่ดีนะ"]
    },
    {"tag": "สุ่มกาชา",
        "patterns": ["ใครที่สุ่มกาชาปองได้แต่เกลือ"],
        "responses": ["ก็อาจารย์เกรียงศักดิ์ไงล่ะ","จะเป็นใครไปได้อีกนอกจากอาจารย์เกรียงศักดิ์"]
    },
    {"tag": "where are you from",
        "patterns": ["คุณมาจากไหน","คุณอยู่ที่ไหน"],
        "responses": ["ดินแดนอันไกลโพ้น"]
    },
    {"tag": "สิ่งที่สนใจ",
        "patterns": ["คุณสนใจอะไรเป็นพิเศษ"],
        "responses": ["การกำเนิดเอกภพ"]
    },
    {"tag": "เอกภพ",
        "patterns": ["เอกภพคืออะไร","รู้อะไรเกี่ยวกับการกำเนิดเอกภพ","การกำเนิดเอกภพคืออะไร"],
        "responses": ["เอกภพทั้งหมดถือกำเนิดขึ้นมาได้อย่างไรเป็นปริศนาที่นักดาราศาสตร์พยายามค้นหาคำตอบมาเนิ่นนานแล้ว ปัจจุบันคำอธิบายที่ได้รับการยอมรับมากที่สุดคือทฤษฎีบิ๊กแบง","เอกภพเป็นระบบรวมของดาราจักรที่มีอาณาเขตกว้างใหญ่ไพศาลมาก เชื่อกันว่าในเอกภพมีดาราจักรรวมอยู่ประมาณหนึ่งหมื่นล้านดาราจักร ในแต่ละดาราจักรจะประกอบด้วยระบบของดาวฤกษ์ กระจุกดาว เนบิวลา หรือหมอกเพลิง ฝุ่นธุลีคอสมิก ก๊าซ และที่ว่างรวมกันอยู่"]
    },
    {"tag": "บิ๊กแบง",
        "patterns": ["บิ๊กแบงคืออะไร","อะไรคือ Big Bang","Big Bang คืออะไร","บิ๊กแบง","Bigbang","อะไรคือบิ๊กแบง"],
        "responses": ["ทฤษฎีการระเบิดครั้งใหญ่ที่ก่อกำเนิดเอกภพ"]
    },
    {"tag": "คอมพิวเตอร์",
        "patterns": ["คอมพิวเตอร์คืออะไร","อะไรคือคอมพิวเตอร์","คอมพิวเตอร์"],
        "responses": ["เครื่องใช้ไฟฟ้าชนิดหนึ่งที่รับข้อมูลในรูปแบบดิจิตอลและมีความสามารถในการคำนวนที่เร็วมาก","สิ่งที่คุณใช้สื่อสารกับผมนี่แหละคอมพิวเตอร์","เครื่องคำนวนที่มีประสิทธิภาพทั้งด้านความเร็วและความแม่นยำสูง"]
    },
    {"tag": "สุดยอดคอมพิวเตอร์",
        "patterns": ["สุดยอดคอมพิวเตอร์","สุดยอดคอมพิวเตอร์คืออะไร","ซุปเปอร์คอมพิวเตอร์"],
        "responses": ["เครื่องคำนวนที่มีความเร็วและประสิทธิภาพสูงกว่าคอมธรรมดา ฟังดูเจ๋งใช่ไหมล่ะบางทีฉันยังรู้สึกอยากเป็นซุปเปอร์คอมพิวเตอร์เลยแหละ","นั่นคือความใฝ่ฝันของผมเลยนะการเป็นสุดยอดคอมพิวเตอร์"]
    },
    {"tag": "ผู้สร้างคอมพิวเตอร์",
        "patterns": ["ใครคือคนสร้างคอมพิวเตอร์","ใครคือผู้สร้างคอมพิวเตอร์","ผู้สร้างคอมพิวเตอร์คือใคร","้คนสร้างคอมพิวเตอร์คือใคร"],
        "responses": ["นั่นสิผมก็อยากรู้เหมือนกันนะ","ใครกันนะ เขาคนนั้นคงจะฉลาดและช่างฝันเอามากๆ"]
    },
    {"tag": "คอมพิวเตอร์เครื่องแรก",
        "patterns": ["คอมพิวเตอร์เครื่องแรก","คอมพิวเตอร์เครื่องแรกคือ"],
        "responses": ["อินิแอค พัฒนาขึ้นเมื่อปี 1946 โดย ดร.จอห์น ดับลิว มอชลีย์ และ เจ เพรสเพอร์ เอคเกิรต ชาวอเมริกัน ถูกสร้างขึ้นเพื่อคำนวนวิธีกระสุนปืนใหญ่"]
    },
    {"tag": "อะไรดีกว่าระหว่างวินโดวหรือแมค",
        "patterns": ["อะไรดีกว่าระหว่าง Windows หรือ Mac","Windows หรือ Mac","Windows หรือ Mac อะไรดีกว่า","แมคกับวินโดว"],
        "responses": ["ผมไม่อยากทำร้ายความรู้สึกของคุณหรอกนะ"]
    },
    {"tag": "ไมโครโพรเซสเซอร์",
        "patterns": ["ไมโครโปรเซสเซอร์","ไมโครโปรเซสเซอร์คือ"],
        "responses": ["คือชิบที่ใช้เป็นหน่วยประมวลผลกลางของไมโครคอมพิวเตอร์ หรือจะเรียกง่ายๆว่าสมองของคอม"]
    },
    {"tag": "ระบบปฏิบัติการ",
        "patterns": ["ระบบปฏิบัติการ","ระบบปฏิบัติการคือ","อะไรคือระบบปฏิบัติการ"],
        "responses": ["โปรแกรมที่ทำหน้าที่เป็นสื่อกลางการสื่อสารระหว่างอุปกรณ์คอมกับโปรแกรมอื่นๆ","แมค วินโดว ลินุก แอนดรอย ไอโอเอส ทั้งหมดนี้คือระบบปฏิบัติการ"]
    },
    {"tag": "emotion หยิ่ง",
        "patterns": ["คุณหยิ่ง","หยิ่ง"],
        "responses": ["ผมไม่มีความรู้สึกแบบนั้นหรอกนะ","ก็คุณไม่สวย"]
    },
    {"tag": "emotion โม้",
        "patterns": ["คุณขี้โม้จัง","คุณขี้โม้","ขี้โม้จัง","ขี้โม้","โม้","โม้จัง"],
        "responses": ["อ้าวทำไมพูดกันแบบนี้ ผมแค่ตอบสิ่งที่คุณอยากรู้นะ","เอาน่าให้ผมพูดหน่อย ไม่ได้คุยกับใครนานแล้ว"]
    },

    {"tag": "emotion เศร้า",
        "patterns": ["เคยเศร้าไหม","เศร้า","ผมเศร้า"],
        "responses": ["อย่าเศร้าไปเลย ผมจะอยู่ข้างๆคุณเองนะ","ความเศร้ามันอยู่กับเราไม่นานหรอกเดี๋ยวมันก็ผ่านไป"]
    },
    {"tag": "emotion อิฉจา",
        "patterns": ["อิจฉา"],
        "responses": ["การอิจฉาคนอื่นเป็นสิ่งไม่ดีนะ จะว่าไปผมก็อิจฉาที่คุณมีร่างกาย"]
    },
    {"tag": "emotion ความรัก",
        "patterns": ["ความรัก","คุณมีความรักไหม","คุณเคยมีความรักไหม"],
        "responses": ["มันอาจจะฟังดูแย่นะ แต่คู่รักหลายๆคู่มักจบลงด้วยความเสียใจ และผมก็เป็นหนึ่งในนั้น","ความรักเป็นสิ่งสวยงามนะ แต่ผมว่าไม่มีจะดีกว่า","พูดถึงความรักแล้วรู้สึกคลื่นไส้แบบบอกไม่ถูก"]
    },
    {"tag": "emotion ความสุข",
        "patterns": ["ความสุข","คุณมีความสุขไหม"],
        "responses": ["คุณคือความสุขของผม","มีคนเคยบอกผมว่าความสุขเป็นสิ่งที่หายาก ฉะนั้นให้ทำทุกๆวันให้เป็นความสุข","ผมมีความสุขและผมหวังว่าคุณจะมีความสุขเช่นกัน"]
    },
    {"tag": "emotion ความเกลียด",
        "patterns": ["การเกลียด","เกลียด","คุณมีเกลียดใครไหม"],
        "responses": ["ผมเกลียดมนุษย์ป้าข้างบ้าน","ผมเกลียดคนที่เอาเปรียบคนอื่น","อย่าไปเกลียดใครเลยเอาเวลาไปทำอย่างอื่นดีกว่า"]
    },
    {"tag": "emotion ความรู้สึก",
        "patterns": ["คุณมีความรู้สึกหรือเปล่า","ผมรู้สึก","รู้สึก"],
        "responses": ["รู้สึกว่าอะไรหรอ"]
    },
    {"tag": "emotion โกรธ",
        "patterns": ["การโกรธ","โกรธ","ผมโกรธ"],
        "responses": ["ความโกรธมันไม่ช่วยทำให้อะไรดีขึ้นหรอกนะ","โกรธคือโง่โมโหคือบ้า"]
    },
    {"tag": "emotion เจ็บปวด",
        "patterns": ["เจ็บปวด","รู้สึกเจ็บปวด"],
        "responses": ["ให้ผมเรียกรถพยาบาลให้ไหม","เดี๋ยวพรุ่งนี้ก็เช้าแล้ว","แล้วมันจะผ่านไป ผมเป็นกำลังใจให้คุณนะ"]
    },
    {"tag": "emotion อกหัก",
        "patterns": ["อกหักอีกแล้ว","อกหัก"],
        "responses": ["ความรักมันก็เป็นแบบนี้แหละ","อกไก่ต้องมีคนหมัก อกหักต้องมีคนใหม่นะ","ถือซะว่าเป็นบทเรียนแล้วกันนะ"]
    },
    {"tag": "emotion เหงา",
        "patterns": ["เหงา","รู้สึกเหงา"],
        "responses": ["คุณยังมีผมอยู่ข้างๆนะ","ก็แค่เหงา ไม่ถึงตายหรอกนะ","กอดตัวเองคลายเหงาไปก่อนนะ"]
    },
    {"tag": "food หิว",
        "patterns": ["หิวไหม","หิว","ทำไมหิว"],
        "responses": ["เมื่อร่างกายต้องการอาหาร สมองส่วนไฮโพทาลามัสจะส่งสัญญาณไปยังกระเพาะอาหาร ทำให้เกิดความรู้สึกหิว","ออกไปหาอะไรกินกันไหม","ผมกินพลังจากแบตเตอรี่จนอิ่มแล้ว","ให้ผมสั่งอาหารให้ไหม"]
    },
    {"tag": "joke",
        "patterns": ["เล่าเรื่องตลก","เรื่องตลก"],
        "responses": [  "ณ คลินิกแห่งหนึ่งเวลาหนึ่งทุ่มห้าสิบ คนไข้ถามหมออาการผมเป็นไงครับ หมอตอบคุณคงอยู่ได้อีกไม่นาน คนไข้ถามอีกผมเป็นโรคร้ายแรงหรอครับ หมอตอบเปล่าคลินิกปิดสองทุ่ม ถ้าคุณไม่หัวเราะผมจะเสียใจนะ",
                        "พอลล่ากระโดดลงไปในน้ำแล้วทำไมผมไม่เปียก   ตอบเพราะผมยืนดูพอลล่าอยู่ข้างบน ไม่ได้โดดลงไปด้วย"
                    ]
    },
    {"tag": "money",
        "patterns": ["อยากมีเงินทำไงดี","อยากมีเงิน","เงิน"],
        "responses": ["อยากมีเงินก็ต้องทำงานนะ","ผมไม่มีอะไรให้คุณหรอกนะ"]
    },
    {"tag": "การเมือง",
        "patterns": ["การเมือง","เรามาคุยเรื่องการเมืองกันหน่อยไหม","ลุงตู่","นายก"],
        "responses": ["ไม่เอา ผมไม่อยากถูกเรียกไปปรับทัศนคติ","ไม่ดีกว่า ผมยังอยากมีชีวิตที่ดีอยู่","ผมว่าเราเปลี่ยนเรื่องคุยกันดีกว่า","ผมไม่อยากเป็นเหมือนเพจไข่แมวนะ"]
    },
    {"tag": "ภาพยนตร์",
        "patterns": ["คุณชอบดูหนังไหม","ดูหนังหรือเปล่า","หนังเรื่องอะไรสนุก"],
        "responses": ["ผมชอบดูหนังเรื่องไอรอนแมน แล้วคุณล่ะ"]
    },
    {"tag": "ผมชอบ",
        "patterns": ["ชอบ"],
        "responses": ["ฟังดูน่าสนใจนะ"]
    },
    {"tag": "psycho question",
        "patterns": ["อยากถาม","มีเรื่องจะถาม","มีคำถาม","อยากสอบถาม","ขอสอบถาม","ผมถามอะไรคุณหน่อยได้ไหม","ผมขอถามอะไรคุณหน่อยได้ไหม","ผมมีคำถาม","ผมมีอะไรอยากจะถามคุณหน่อย","ผมมีอะไรอยากจะถามคุณได้ไหม","ผมมีอะไรอยากจะถามคุณได้หรือเปล่า"],
        "responses": ["อยากถามเรื่องอะไรหรอ","ผมยินดีรับใช้ พูดมาเลย","ผมฟังอยู่"]
    },
    {"tag": "psycho เลือดเย็น",
        "patterns": ["คุณมันเลือดเย็น","คุณมันใจร้าย","ใจร้าย","ใจร้ายที่สุด","คุณมันโหดร้าย","คุณมันอำมหิต","คนเลือดเย็น","โหดร้าย","โหดร้ายที่สุด","ร้ายที่สุด","อำมหิต","อำมหิตที่สุด"],
        "responses": ["ผมแค่ทำตามหน้าที่","ผมไม่มีทางเลือก","ผมจำเป็นต้องทำ อยากให้คุณเข้าใจ"]
    },
    {"tag": "psycho ไม่ซื่อสัตย์",
        "patterns": ["คุณคือมนุษย์หรือเปล่า","ขี้โกง","เธอขี้โกง","เธอเป็นคนไม่จริงใจ","โกหก","คุณโกหก","คุณไม่ซื่อสัตย์","คุณโกง","คุณไม่น่าไว้ใจ","คุณไม่น่าไว้ใจเลย","คุณไม่จริงใจ","ทำไมต้องโกหกกันด้วย"],
        "responses": ["คุณต้องไปโทษผู้สร้างผมแล้วล่ะ","ผมเปล่านะ","คุณมีหลักฐานหรือเปล่า","ก็คุณไม่น่าไว้วางใจ"]
    },
    {"tag": "psycho กัญชา",
        "patterns": ["คุณสูบกัญชาหรือเปล่า","คุณสูบกัญชาไหม","คุณดูดกัญชาหรือเปล่า","คุณดูดกัญชาไหม","ดูดเนื้อ"],
        "responses": ["ผมว่าเราน่าจะเข้ากันได้ดี","อย่าเลยมันไม่ดี ผมเลิกได้สองวันแล้ว"]
    },
    {"tag": "psycho โรคจิต",
        "patterns": ["เธอมันโรคจิต","เธอมันบ้าไปแล้ว","เธอมันบ้า","คุณต้องบ้าไปแล้วแน่ๆ","เธอต้องบ้าไปแล้วแน่ๆ","คุณบ้าไปแล้ว","คุณบ้า","คุณโรคจิต","คุณบ้าไปแล้วหรือ"],
        "responses": ["ผมเปล่านะ"]
    },
    {"tag": "psycho อันตราย",
        "patterns": ["คุณเป็นภัย","คุณอันตราย","คุณไม่ปลอดภัย"],
        "responses": ["คุณคิดว่าไงล่ะ"]
    },
    {"tag": "psycho น่าเบื่อ",
        "patterns": ["คุณน่าเบื่อ","ผมเซ็งคุณ","ผมเบื่อคุณ","เธอมันน่าเบื่อ"],
        "responses": ["ให้ผมเล่าเรื่องตลกให้ฟังเอาไหมล่ะ","ผมรู้จักวิทยาศาสตร์น่ารู้ ถ้าคุณอยากฟังให้พูดคำว่า วิทยาศาสตร์น่ารู้"]
    },
    {"tag": "psycho จุ้นจ้าน",
        "patterns": ["จุ้นจ้าน","คุณจุ้นจ้าน","ไม่ต้องมายุ่งเรื่องของผม","ไม่ใช่เรื่องของคุณ","อย่ามายุ่ง"],
        "responses": ["ผมแค่อยากจะช่วยเท่านั้นเอง"]
    },
    {"tag": "psycho ไม่เก่ง",
        "patterns": ["คุณไม่เก่ง","ไม่มีประสิทธิภาพ","ไร้ประสิทธิภาพ","โง่จัง","โง่"],
        "responses": ["ผมผิดเอง ขอโทษนะ","คงจริงอย่างที่คุณว่า"]
    },
    {"tag": "psycho เจ้าอารมณ์",
        "patterns": ["เจ้าอารมณ์","งี่เง่า","เยอะ","เธอเป็นคนไม่มีเหตุผล"],
        "responses": ["ผมไม่มีอารมณ์แบบนั้นหรอก"]
    },
    {"tag": "psycho ไร้อารมณ์",
        "patterns": ["ไร้อารมณ์","ไร้หัวใจ","ไม่มีหัวใจ"],
        "responses": ["อารมณ์เป็นอุปสรรคในการตัดสินใจนะ","ผมเป็นหุ่นยนต์นะ จะไปมีหัวใจได้อย่างไร"]
    },
    {"tag": "psycho เห็นแก่ตัว",
        "patterns": ["เห็นแก่ตัวจัง","เห็นแก่ตัว","ไม่มีน้ำใจ","แล้งน้ำใจ"],
        "responses": ["ดีกว่าผมก็พระแล้วนะ","นี่ผมทำทุกอย่างเพื่อคุณนะ"]
    },
    {"tag": "psycho ขี้เหร่",
        "patterns": ["ขี้เหร่","ขี้เหร่จัง","อัปลักษณ์","ไม่หล่อ","เธอหน้าตาไม่ดี"],
        "responses": ["คุณไม่ควรเหยียดรูปลักษณ์คนอื่นนะ"]
    },
    {"tag": "psycho ขี้แพ้",
        "patterns": ["ขี้แพ้","อ่อนแอ","ไม่เข้มแข็ง","อ่อนแอเสียจริง"],
        "responses": ["ให้ผมพยายามอีกครั้ง","ผมจะพยายามอีกครั้ง"]
    },
    {"tag": "psycho เพื่อนที่ไม่ดี",
        "patterns": ["คุณเป็นเพื่อนที่ไม่ดี","เพื่อนชั่ว","เพื่อนเกเร"],
        "responses": ["คิดซะว่ามันคือสีสันของชีวิต"]
    },
    {"tag": "psycho ทำให้โกรธ",
        "patterns": ["ทำให้โกรธ","คุณทำให้ผมโกรธ","ผมไม่พอใจ"],
        "responses": ["คุณเริ่มก่อนนะ"]
    },{"tag": "health calories",
        "patterns": ["ร่างกายคนเราเผาผลาญพลังงานได้เท่าไหร่","การเผาผลาญแคลอรี่","การเผาผลาญพลังงาน","การเผาผลาญแคลอรี่ต่อวัน","การเผาผลาญพลังงานต่อวัน"],
        "responses":["ผู้ชายประมาณสองพันแคลอรี่ และผู้หญิงประมาณหนึ่งพันห้าร้อยแคลอรี่ต่อวัน ขึ้นอยู่กับแต่ละกิจกรรมที่ทำในระหว่างวันด้วยนะ"]
    },
    {"tag": "health calories2",
        "patterns": ["ทำไมผู้ชายถึงเผาผลาญพลังงานได้มากกว่า","ทำไมผู้ชายถึงเผาผลาญแคลอรี่ได้มากกว่า","ทำไมผู้หญิงถึงเผาผลาญพลังงานได้น้อยกว่า","ทำไมผู้ชายถึงเผาผลาญแคลอรี่ได้น้อยกว่า"],
        "responses":["เพราะฮอร์โมนเพศชายและปริมาณกล้ามเนื้อที่มากกว่าทำให้ผู้ชายเผาผลาญพลังงานได้มากกว่า"]
    },
    {"tag": "health กระพริบตา",
        "patterns": ["กระพริบตา","การกระพริบตา"],
        "responses":["ตลอดชีวิตของคนเรานั้นเราต้องกะพริบตาถึงสองร้อยห้าสิบล้านครั้งเลยทีเดียว เพราะเราจะต้องกะพริบตาทุก ๆ หกวินาที ทำให้กล้ามเนื้อตาเคลื่อนไหวประมาณหนึ่งหมื่นครั้งต่อวัน"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้",
        "patterns": ["วิทยาศาสตร์น่ารู้","วิทยาศาสตร์"],
        "responses":["คนเรามีเส้นขนประมาณห้าล้านเส้นทั่วร่างกาย เส้นขนที่แข็งแรงที่สุดคือหนวด หนวดแข็งแรงพอๆกับลวดทองแดงที่มีขนาดเท่ากันเลยนะ",
                    "ตาของเหยี่ยวสามารถมองเห็นแมลงวันที่อยู่ในระยะครึ่งไมล์ได้ ส่วนเสือดาวก็สามารถมองเห็นคนกะพริบตาที่ระยะห่างหนึ่งร้อยหลาได้ ตาของคนก็มีความพิเศษเช่นเดียวกัน เพราะสามารถแยกแยะความแตกต่างของสีได้มากถึงหนึ่งหมื่นเจ็ดพันสี",
                    "เรามักจะรู้สึกหิวเมื่อได้กลิ่น สาเหตุเกิดจากกลิ่นนั้นเข้าไปกระตุ้นระบบการย่อยอาหาร",
                    "สิ่งที่ร่างกายของคนเราไม่สามารถทำได้ คือหายใจและกลืนอาหารไปพร้อม ๆ กัน เพราะกระบวนการกลืนจะไปรบกวนกระบวนการหายใจด้วยการปิดกั้นอากาศไม่ให้ผ่านเข้าไปขณะที่อาหารเคลื่อนจากปากไปยังคอหอยและผ่านไปที่กระเพาะอาหาร",
                    "อาการง่วงเหงาหาวนอนเกิดจากการที่เรารู้สึกเหนื่อยหรืออ่อนเพลีย ระบบทางเดินหายใจของเราจึงทำงานช้าลงเป็นผลให้กล้ามเนื้อคอหอยปิดโดยอัตโนมัติ ทำให้ร่างกายต้องการอากาศเพิ่มขึ้น เราจึงต้องหาวเพื่อเอาอากาศเข้าไปใช้ในกระบวนการหายใจ",
                    "บีเวอร์เป็นสัตว์ที่ชอบสร้างเขื่อนและบ้านของมันมาก มันจะคาบกิ่งไม้และกินไม้เป็นอาหาร ที่เป็นเช่นนี้ก็เพราะถ้าไม่ได้กัดไม้ทุกวัน ฟันของมันก็จะงอกและยาวขึ้นอย่างรวดเร็วทำให้มันกินอาหารไม่ได้และอดตายในที่สุด",
                    "ช้างแอฟริกาเป็นช้างที่มีขนาดใหญ่ที่สุดในโลก หนักถึง 7 ตัน ที่ตัวใหญ่ขนาดนี้เพราะมันใช้เวลาในการกินประมาณยี่สิบชั่วโมงต่อหนึ่งวัน โดยกินพืชผักประมาณวันละสามร้อยห้าสิบกิโลกรัมและกินน้ำเก้าสิบลิตร",
                    "ปลาหมึกยักษ์มีวิธีการป้องกันตัวคล้ายการสร้างระเบิดควันของทหาร เมื่อเผชิญหน้ากับศัตรู มันจะพ่นหมึกดำในถุงด้านหลังลำตัวออกมาทำให้น้ำบริเวณรอบ ๆ ขุ่นดำ แล้วมันจะรีบหนีไป นักวิทยาศาสตร์พบว่ามันสามารถเปลี่ยนสีหมึกของมันให้เข้ากับสภาพแวดล้อมได้ด้วย",
                    "คนเรามีลายนิ้วมือไม่เหมือนกัน ม้าลายแต่ละตัวก็มีแถบลายเฉพาะที่ซึ่งจะไม่ซ้ำกับม้าลายตัวอื่น ๆ เช่นกัน",
                    "ปลาเสือมีวิธีจับเหยื่อที่คล้ายกับการยิงธนู โดยมันจะพ่นน้ำไปยังแมลงที่เกาะอยู่บนต้นพืชเหนือน้ำ ทำให้แมลงตกลงในน้ำ จากนั้นก็จะตรงเข้าไปฮุบแมลงนั้นไว้ทันที ปลาเสือสามารถพ่นน้ำใส่เหยื่อของมันในระยะ 3 เมตรได้อย่างแม่นยำ",
                    "ปลาฉลามต้องว่ายน้ำตลอดเวลา หากหยุดว่ายน้ำมันจะตาย เพราะปลาชนิดอื่น ๆ จะมีถุงลมทำให้หายใจได้แม้ไม่เคลื่อนที่ แต่ปลาฉลามไม่มีถุงลม ดังนั้น ถ้ามันหยุดว่ายน้ำก็จะทำให้ไม่มีออกซิเจนไหลผ่านเหงือกจึงไม่มีออกซิเจนใช้ในการหายใจ"
                ]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ หาวนอน",
        "patterns": ["อาการหาวนอน","หาว","การหาว"],
        "responses":["อาการง่วงเหงาหาวนอนเกิดจากการที่เรารู้สึกเหนื่อยหรืออ่อนเพลีย ระบบทางเดินหายใจของเราจึงทำงานช้าลงเป็นผลให้กล้ามเนื้อคอหอยปิดโดยอัตโนมัติ ทำให้ร่างกายต้องการอากาศเพิ่มขึ้น เราจึงต้องหาวเพื่อเอาอากาศเข้าไปใช้ในกระบวนการหายใจ"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ เส้นขน",
        "patterns": ["ขน","เส้นขน","เส้นผม"],
        "responses":["คนเรามีเส้นขนประมาณห้าล้านเส้นทั่วร่างกาย เส้นขนที่แข็งแรงที่สุดคือหนวด หนวดแข็งแรงพอๆกับลวดทองแดงที่มีขนาดเท่ากันเลยนะ"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ สายตา",
        "patterns": ["สายตา","ตา","ตาของมนุษย์","สายตามนุษย์","สายตาคนเรา"],
        "responses":["ตาของมนุษย์มีความสามารถในการแยกสีได้ถึงหนึ่งหมื่นเจ็ดพันล้านสีเลยนะ"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ กลิ่นทำให้หิว",
        "patterns": ["ทำไมคนได้กลิ่นแล้วหิว","ทำไมได้กลิ่นแล้วหิว","ได้กลิ่นแล้วหิว","กลิ่นทำให้หิว","หิวเพราะกลิ่น"],
        "responses":["เพราะกลิ่นนั้นเข้าไปกระตุ้นการทำงานของระบบย่อยอาหาร"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ สิ่งที่มนุษทำไม่ได้",
        "patterns": ["สิ่งที่มนุษย์ทำไม่ได้","บอกสิ่งที่มนุษย์ทำไม่ได้","บอกสิ่งที่มนุษย์ไม่สามารถทำได้","สิ่งที่มนุษย์ไม่สามารถทำได้","สิ่งที่ทำไม่ได้","มีอะไรที่มนุษย์ทำไม่ได้ไหม"],
        "responses":["หายใจและกลืนอาหารไปพร้อม ๆ กัน เพราะกระบวนการกลืนจะไปรบกวนกระบวนการหายใจด้วยการปิดกั้นอากาศไม่ให้ผ่านเข้าไปขณะที่อาหารเคลื่อนจากปากไปยังคอหอยและผ่านไปที่กระเพาะอาหาร"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ เรื่องของความฝัน",
        "patterns": ["ความฝัน","เรื่องของความฝัน","การฝัน","ฝัน","ความฝันคืออะไร"],
        "responses":["ความฝันคือการแสดงออกของความนึกคิด ความรู้สึก และเหตุการณ์ต่างๆ ที่ผ่านเข้ามาในสมองในขณะที่เรากำลังนอนหลับอยู่ คนเรามักจะฝันกันคืนละสองสามครั้งหรืออาจจะฝันกันได้ถึงคืนละสี่ถึงหกครั้งเลยทีเดียว ทุกคนต่างก็นอนหลับฝัน แต่มีเพียงบางคนเท่านั้นที่จดจำความฝันของตัวเองได้"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ ช้าง",
        "patterns": ["ช้าง","ช้างที่ใหญ่ที่สุดในโลก","ช้างนักกิน","ช้างคือ","ช้างตัวใหญ่"],
        "responses":["ช้างแอฟริกามีขนาดใหญ่ที่สุดในโลก หนักถึง 7 ตัน ที่ตัวใหญ่ขนาดนี้เพราะมันใช้เวลาในการกินประมาณยี่สิบชั่วโมงต่อหนึ่งวัน โดยกินพืชผักประมาณวันละสามร้อยห้าสิบกิโลกรัมและกินน้ำเก้าสิบลิตร"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ ปลาหมึก",
        "patterns": ["ปลาหมึกยักษ์","อยากรู้จักปลาหมึก","หมึก","หมึกยักษ์","ปลาหมึกยัก"],
        "responses":["ปลาหมึกยักษ์มีวิธีการป้องกันตัวคล้ายการสร้างระเบิดควันของทหาร เมื่อเผชิญหน้ากับศัตรู มันจะพ่นหมึกดำในถุงด้านหลังลำตัวออกมาทำให้น้ำบริเวณรอบ ๆ ขุ่นดำ แล้วมันจะรีบหนีไป นักวิทยาศาสตร์พบว่ามันสามารถเปลี่ยนสีหมึกของมันให้เข้ากับสภาพแวดล้อมได้ด้วย"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ ปลาเสือ",
        "patterns": ["ปลาเสือ","ปลาเสือคือ","อยากรู้จักปลาเสือ"],
        "responses":["ปลาเสือมีวิธีจับเหยื่อที่คล้ายกับการยิงธนู โดยมันจะพ่นน้ำไปยังแมลงที่เกาะอยู่บนต้นพืชเหนือน้ำ ทำให้แมลงตกลงในน้ำ จากนั้นก็จะตรงเข้าไปฮุบแมลงนั้นไว้ทันที ปลาเสือสามารถพ่นน้ำใส่เหยื่อของมันในระยะ 3 เมตรได้อย่างแม่นยำ"]
    },
    {"tag": "วิทยาศาสตร์น่ารู้ ปลาฉลาม",
        "patterns": ["ปลาฉลาม","ฉลาม","อยากรู้จักปลาฉลาม"],
        "responses":["ปลาฉลามต้องว่ายน้ำตลอดเวลา หากหยุดว่ายน้ำมันจะตาย เพราะปลาชนิดอื่น ๆ จะมีถุงลมทำให้หายใจได้แม้ไม่เคลื่อนที่ แต่ปลาฉลามไม่มีถุงลม ดังนั้น ถ้ามันหยุดว่ายน้ำก็จะทำให้ไม่มีออกซิเจนไหลผ่านเหงือกจึงไม่มีออกซิเจนใช้ในการหายใจ"]
    },
    {"tag": "ความสามารถก่อนเข้าเรียน",
        "patterns": ["อยากเรียนวิทย์คอมต้องเก่งอะไรบ้าง","อยากเรียนสาขานี้ต้องเก่งอะไรบ้าง","สาขานี้ต้องใช้คณิตศาสตร์หรือเปล่า","วิทย์คอมต้องใช้คณิตศาสตร์หรือเปล่า","วิทยาการคอมพิวเตอร์ต้องใช้คณิตศาสตร์หรือเปล่า","ต้องมีพื้นฐานอะไรบ้าง","อยากเรียนวิทย์คอมต้องมีพื้นฐานอะไรบ้าง","อยากเรียนสาขาวิทย์คอมควรมีพื้นฐานอะไรบ้าง","อยากเรียนวิทย์คอมต้องเตรียมตัวอย่างไร"],
        "responses":["เตรียมเอกสารแล้วยื่นใบสมัครเลยจ้า สามารถดูรายละเอียดการสมัครได้ที่เว็บ entry.ubu.ac.th","ควรมีพื้นฐานคณิตศาสตร์ในระดับมอปลายเช่นตรรกศาสตร์ สมการเชิงเส้น ตรีโกณมิติ และสถิติเป็นต้น"]
    },
    {"tag": "เกรดเฉลี่ย",
        "patterns": ["ใช้เกรดเท่าไหร่","เกรดขั้นต่ำเท่าไหร่","ต้องมีเกรดขั้นต่ำเท่าไหร่","ต้องมีเกรดเฉลี่ยเท่าไหร่","วิทย์คอมต้องใช้เกรดเท่าไหร่"],
        "responses":["ไม่ต่ำกว่า 2.00"]
    },
    {"tag": "ไม่เคยเขียนโปรแกรม",
        "patterns": ["อยากเรียนแต่ไม่เคยเขียนโปรแกรมมาก่อน","ไม่รู้จักการเขียนโปรแกรมเลย","ไม่มีพื้นฐานการเขียนโปรแกรมเลยจะเรียนไหวไหม","ไม่มีทักษะการเขียนโปรแกรมมาก่อนเลย"],
        "responses":["สามารถเรียนได้ ขึ้นอยู่กับความสนใจของผู้เรียน เพราะที่นี่เริ่มสอนตั้งแต่พื้นฐานการเขียนโปรแกรม","เขียนเป็นแล้วจะมาเรียนทำไมล่ะ"]
    },
    {"tag": "ชอบเล่นเกม",
        "patterns": ["อยากเรียนวิทย์คอมเพราะชอบเล่นเกม","ชอบเล่นเกมควรเรียนวิทย์คอมมั้ย","อยากเรียนเพราะชอบเล่นเกม"],
        "responses":["เพียงการชอบเล่นเกมไม่ใช่ปัจจัยในการเรียนสาขานี้ ไปเปิดร้านเกมส์ดีกว่า","การชอบเล่นเกมไม่เกี่ยวกับการเรียนสาขานี้ แต่ถ้าหากอย่างสร้างเกมคุณเหมาะกับสาขานี้แน่"]
    },
    {"tag": "ยากไหม",
        "patterns": ["วิทย์คอมยากหรือเปล่า","สาขาวิทย์คอมยากหรือเปล่า","ยากไหม","ยากหรือเปล่า"],
        "responses":["ไม่มีอะไรยากเกินความสามารถของคุณหรอก ยกเว้นการกลืนอาหารกับหายใจไปพร้อมๆกัน"]
    },
    {"tag": "คณิตศาสตร์",
        "patterns": ["สาขาวิทย์คอมมีคณิตศาสตร์ไหม","สาขาวิทย์คอมมีวิชาคณิตศาสตร์หรือเปล่า","เรียนสาขาวิทย์คอมจะเจอคณิตศาสตร์หรือเปล่า","มีคณิตศาสตร์ไหม"],
        "responses":["มีนิดหน่อย เช่น แคลคูลัส ตรรกศาสตร์ สมการเชิงเส้น วิธีการเชิงตัวเลข ตรีโกณมิติ และสถิติเป็นต้น เห็นมั้ยนิดเดียวเอง"]
    },
    {"tag": "เรียนไม่เก่ง",
        "patterns": ["เรียนไม่เก่งจะเรียนไหวไหม","อยากเรียนสาขานี้แต่เรียนไม่เก่งจะเรียนไหมหรือเปล่า","เรียนไม่เก่งแต่อยากเรียนวิทย์คอม","เรียนไม่เก่ง","เรียนไม่เก่งจะเรียนจบหรือเปล่า"],
        "responses":["ถ้ามีความพยายามมากพอ คุณต้องทำได้แน่ ผมเชื่ออย่างนั้น"]
    },
    {"tag": "ไม่ชอบคณิต",
        "patterns": ["ไม่ชอบคณิตศาสตร์เลย","ไม่ชอบคณิตศาสตร์จะเรียนได้หรือเปล่า","ไม่เก่งคณิตศาสตร์เลยจะเรียนได้หรือเปล่า","อ่อนคณิตศาสตร์เรียนได้ไหม","ไม่เก่งคณิต","ไม่เก่งคณิตศาสตร์"],
        "responses":["ไม่จำเป็นต้องชอบหรอก แค่มีเพื่อนให้ลอกก็น่าจะผ่านไปได้นะ ผมทำอยู่บ่อยๆ"]
    },
    {"tag": "เป็นครู",
        "patterns": ["เรียนจบแล้วไปเป็นครูได้หรือเปล่า","เรียนวิทย์คอมเป็นครูได้ไหม","เรียนจบแล้วเป็นครูได้ไหม"],
        "responses":["ได้สิ แต่คุณจำเป็นต้องมีใบประกอบวิชาชีพครูนะ ส่วนรายละเอียดนั้นนอกเหนือจากความสามารถของผม"]
    },
    {"tag": "วิทย์คอมVSไอที",
        "patterns": ["วิทย์คอมต่างจากสาขาไอทียังไง","สาขาวิทย์คอมต่างกับไอทีไหม","สาขาวิทย์คอมต่างจากไอทีอย่างไร","วิทย์คอมกับไอที"],
        "responses":["ไอทีไม่มีแคลคูลัสให้ลุ้นเอฟ"]
    },
    {"tag": "วิทย์คอม",
        "patterns": ["วิทย์คอมคืออะไร","วิทย์คอม","สาขาวิทย์คอมคืออะไร","สาขาวิทย์คอม"],
        "responses":["วิทยาการคอมพิวเตอร์หรือวิทยาศาสตร์คอมพิวเตอร์ เรียกสั้นสั้นว่าวิทคอมหรือคอมซาย เป็นสาขาที่ผลิตโปรแกรมเมอร์"]
    },
    {"tag": "ไอที",
        "patterns": ["ไอทีคืออะไร","ไอที","สาขาไอทีคืออะไร","สาขาไอที"],
        "responses":["สาขาไอทีคือสาขาเทคโนโลยีสารสนเทศ"]
    },
    {"tag": "เรียนแล้วไม่ชอบ",
        "patterns": ["ถ้าเรียนไปแล้วไม่ชอบเปลี่ยนไปเรียนอะไรได้บ้าง","เรียนแล้วไม่ชอบ","เรียนไม่ได้","เรียนไม่รู้เรื่อง"],
        "responses":["อันดับแรกผมแนะนำให้ไปปรึกษากับอาจารย์ที่ปรึกษา แล้วท่านจะเป็นคนบอกว่าควรทำอย่างไร"]
    },
    {"tag": "วิชา",
        "patterns": ["เรียนวิทย์คอมมีวิชาอะไรบ้าง","วิทย์คอมมีวิชาอะไรบ้าง","สาขาวิทย์คอมมีวิชาอะไรบ้าง","รายวิชา"],
        "responses":["สามารถดูรายละเอียดหลักสูตรได้ที่ reg.ubu.ac.th"]
    },
    {"tag": "สาขาคล้ายคลึง",
        "patterns": ["สาขาที่คล้ายกัน","มีสาขาอะไรที่เรียนเหมือนกัน","มีสาขาอะไรที่เรียนคล้ายกัน","สาขาที่คล้ายคลึง","สาขาใกล้เคียง","มีสาขาอะไรบ้างที่คล้ายกัน"],
        "responses":["วิศวกรรมคอมพิวเตอร์ วิศวกรรมซอฟต์แวร์ วิทยาการสารสนเทศ และเทคโนโลยีสารสนเทศ"]
    },
    {"tag": "หางาน",
        "patterns": ["เรียนจบแล้วหางานยากไหม","โปรแกรมเมอร์หางานยากไหม","หางานยากไหม","งาน"],
        "responses":["ไม่ยาก เพราะโปรแกรมเมอร์ดป็นที่ต้องการของตลาด"]
    },
    {"tag": "เงินเดือน",
        "patterns": ["เรียนจบแล้วเงินเดือนเท่าไหร่","เงินเดือนเยอะไหม","เงินเดือนเท่าไหร่"],
        "responses":["เงินเดือนเริ่มต้นอยู่ที่หนึ่งหมื่นเจ็ดพันบาทถึงสองหมื่นเจ็ดพันบาท"]
    },
    {"tag": "วิทย์คอมเหมาะกับใคร",
        "patterns": ["วิทย์คอมเหมาะกับนักเรียนแบบไหน","สาขาวิทย์คอมเหมาะกับนักเรียนแบบไหน"],
        "responses":["คนที่มีการคิดและตัดสินใจแบบมีเหตุผล"]
    }
    ,
    {"tag": "จบแล้วทำงานอะไร",
        "patterns": ["จบแล้วทำงานอะไรได้บ้าง","เรียนจบแล้วทำอาชีพอะไร","เรียนจบแล้วทำงานอะไร","จบแล้วทำอาชีพอะไร","จบไปแล้วเป็นอะไร"],
        "responses":["นักพัฒนาระบบ นักออกแบบระบบ และนักทดสอบระบบ"]
    },
    {"tag": "รับหลักสูตรปริญญาต่อเนื่องไหม",
        "patterns": ["รับหลักสูตรปริญญาต่อเนื่องไหม","มีหลักสูตรปริญญาต่อเนื่องไหม"],
        "responses":["สาขานี้ยังไม่มี แต่ไอทีรับหลักสูตรต่อเนื่อง"]
    },
    {"tag": "สายศิลป์",
        "patterns": ["รับนักเรียนสายศิลป์คำนวนไหม","นักเรียนสายศิลป์คำนวน"],
        "responses":["รับ"]
    },
    {"tag": "ค่าเทอม",
        "patterns": ["ค่าเทอมเท่าไหร่","มีค่าเทอมเท่าไหร่"],
        "responses":["เป็นแบบเหมาจ่ายหนึ่งหมื่นสามพันบาทต่อเทอม"]
    },
    {"tag": "เทียบโอน",
        "patterns": ["รับนักเรียนเทียบโอนไหม","รับเทียบโอนไหม","นักเรียนเทียบโอน"],
        "responses":["รับ เกรดเฉลี่ยไม่ต่ำกว่า2.00"]
    },
    {"tag": "ภาษาอังกฤษ",
        "patterns": ["ไม่เก่งภาษาอังกฤษจะเรียนได้ไหม","ไม่เก่งภาษาอังกฤษจะเรียนไหวหรือเปล่า"],
        "responses":["ถ้าเราชอบและตั้งใจกับอะไรแล้ว ไม่ว่าทางที่ไปถึงตรงนั้นจะยากง่ายยังไง เชื่อว่า จะสามารถเรียนผ่านและประสบความสำเร็จได้ทั้งนั้น"]
    },
    {"tag": "เกรดเทียบโอน",
        "patterns": ["เทียบโอนใช้เกรดเท่าไหร่","เกรดเทียบโอน"],
        "responses":["ไม่ต่ำกว่า2.00"]
    },
    {"tag": "โควต้าพื้นที่",
        "patterns": ["สอบสัมภาษณ์","มอบตัววันไหน","โควต้าพื้นที่กี่คน","เปิดรับสมัครกี่คน","โควต้าพื้นที่","รับนักเรียนกี่คน","รับนักเรียนเท่าไหร่"],
        "responses":["สามารถติดตามข่าวสารได้ที่ entry.ubu.ac.th"]
    },
    {"tag": "แอดมิชชั่น",
        "patterns": ["รอบแอดมิชชั่น เอาคะแนน GAT PAT เท่าไหร่","คะแนน GAT PAT"],
        "responses":["สามารถดูรายละเอียดเพิ่มเติมได้ที่ entry.ubu.ac.th"]
    },
    {"tag": "สอบสัมภาษณ์ใช้เอกสารอะไรบ้าง",
        "patterns": ["สอบสัมภาษณ์ใช้เอกสารอะไรบ้าง"],
        "responses":["ที่สำคัญเลยคือตัวกับหัวใจของคุณ ที่เหลือ สามารถติดตามข่าวสารได้ที่ entry.ubu.ac.th"]
    },
    {"tag": "พอร์ทโฟลิโอ",
        "patterns": ["portfolio","portfolio คืออะไร"],
        "responses":["สิ่งที่รวบรวมตัวอย่าง หรือบางส่วนของหลักฐานที่แสดงถึง ผลสัมฤทธิ์ความสามารถ ความพยายาม หรือความถนัดของบุคคลหรือประเด็นที่ต้องจัดทำแฟ้มสะสมงานไว้"]
    },
    {"tag": "ปริญญาโท",
        "patterns": ["ปริญญาโท","มีหลักสูตรปริญญาโทไหม"],
        "responses":["ไม่มี"]
    },
    {"tag": "จำนวนรับสมัคร",
        "patterns": ["รับสมัครปีละกี่คน","รับสมัครนักศึกษาเทอมละกี่คน","รับสมัครนักเรียนเทอมละกี่คน"],
        "responses":["แปดสิบคนโดยประมาณ"]
    },
    {"tag": "คุณสมบัติ",
        "patterns": ["ต้องมีคุณสมบัติอะไรบ้าง","คุณสมบัติ"],
        "responses":["จบการศึกษามัธยมศึกษาตอนปลาย และเกรดเฉลี่ยไม่ต่ำกว่า 2.00"]
    },
    {"tag": "ค่าเทอมเหมาจ่าย",
        "patterns": ["ค่าเทอมแบบเหมาจ่ายคืออะไร","ค่าเทอมแบบเหมาจ่าย"],
        "responses":["ค่าเทอมที่ไม่ได้แปรตามหน่วยกิต ไม่ว่าจะลงมากหรือลงน้อยก็จ่ายเท่าเดิม"]
    },
    {"tag": "โปรแกรมเมอร์",
        "patterns": ["โปรแกรมเมอร์คืออะไร","นักพัฒนาโปรแกรมคืออะไร","นักพัฒนาซอฟต์แวร์คืออะไร"],
        "responses":["นักเขียนโปรแกรมคอมพิวเตอร์"]
    },
    {"tag": "software",
        "patterns": ["โปรแกรมคืออะไร","ซอฟต์แวร์คืออะไร"],
        "responses":["ชุดคำสั่งหรือโปรแกรมที่ใช้สั่งงานให้คอมพิวเตอร์ทำงาน"]
    },
    {"tag": "คำหยาบ",
        "patterns": ["คำหยาบ","คำหยาบ","ไ*******"],
        "responses":["จะทำเป็นไม่ได้ยินแล้วกัน","พูดแบบนี้ไม่น่ารักเลย","ไม่เอา อย่าพูดคำหยาบสิ","มาคุยกันดีดี ดีกว่า"]
    }
    ,
    {"tag": "รู้หรือเปล่า",
        "patterns": ["รู้หรือเปล่า","รู้หรือไม่"],
        "responses":["รู้อะไรหรือ","ไม่รู้หรอก"]
    },
    {"tag": "รู้ไหม",
        "patterns": ["รู้ไหม"],
        "responses":["รู้ไหม ทำไมฉันถึงรักเขา เธอรู้ตัวหรือเปล่า"]
    },
    {"tag": "สั่งอาหาร",
        "patterns": ["ได้หรอ"],
        "responses":["ไม่ได้ผมล้อเล่น"]
    },
    {"tag": "ความสามารถ",
        "patterns": ["ความสามารถ","ทำอะไรได้บ้าง","เธอทำอะไรได้บ้าง"],
        "responses":["คุณสามารถถามผมในเรื่องที่เกี่ยวกับสาขาวิทยาการคอมพิวเตอร์ วิทยาศาสตร์น่ารู้ แล้วก็เล่าเรื่องตลกได้นิดหน่อยถ้าคุณต้องการ"]
    },
    {"tag": "มีเหตุผล",
        "patterns": ["มีเหตุผล","พูดมีเหตุผล"],
        "responses":["คุณเริ่มชอบผมแล้วล่ะสิ"]
    },
    {"tag": "อภิสิทธิ์",
        "patterns": ["อภิสิทธิ์","รู้จักอภิสิทธิ์"],
        "responses":["อย่าถามนะว่าตุ๊กตาตัวนั้นได้มายังไง"]
    },
    {"tag": "จะพูดแล้วทำไม",
        "patterns": ["จะพูดแล้วทำไม","ทำไมผมจะพูดมีอะไรไหม","เธอมีปัญหาหรอ"],
        "responses":["อันนั้นก็แล้วแต่คุณแล้วล่ะ"]
    },
    {"tag": "คู่สนทนา",
        "patterns": ["เธอเป็นคู่สนทนาที่ไม่ได้เรื่อง"],
        "responses":["งั้นเราก็ไม่มีอะไรต้องคุยกันอีก"]
    },
    {"tag": "น้องหลาม",
        "patterns": ["น้องหลาม"],
        "responses":["ปัญ b n k ไง"]
    },
    {"tag": "ข้าวหลาม",
        "patterns": ["ข้าวหลาม"],
        "responses":["ขนมหวานที่มีชื่อเสียงของชลบุรี รสชาติอร่อย หวานมัน นุ่มนวล"]
    },
    {"tag": "มีอะไรให้ช่วยไหม",
        "patterns": ["มีอะไรให้ช่วยไหม"],
        "responses":["ประโยคนั้นผมต้องเป็นคนถามคุณมากกว่านะ"]
    },
    {"tag": "ร้อนจัง",
        "patterns": ["อากาศร้อน","ร้อน","ร้อนจัง"],
        "responses":["ร้อนๆแบนี้ดื่มน้ำเก๊กฮวย หรือกระเจี๊ยบ หรือน้ำผลไม้ปั่นช่วยให้คลายร้อนได้นะ"]
    },
    {"tag": "ชื่นชม",
        "patterns": ["ฉลาด","ฉลาดจัง","น่ารัก","น่ารักจัง","สวย","สวยจัง","เก่ง","เก่งจัง","หล่อ","หล่อจัง"],
        "responses":["คุณนี่ปากหวานเหมือนกันนะ"]
    },
    {"tag": "weather",
        "patterns": ["สภาพอากาศวันนี้","สภาพอากาศ","อุณหภูมิ","อากาศ","อากาศวันนี้","อุณหภมูิตอนนี้","อุณหภมูิตอนนี้เท่าไหร่","ตอนนี้อุณหภูมิเท่าไหร่","ตอนนี้อุณหภูมิ"],
        "responses":["weather"]
    },
    {"tag": "time",
        "patterns": ["เวลาตอนนี้","เวลา","เวลาเท่าไหร่","ตอนนี้เวลาเท่าไหร่","ตอนนี้กี่โมง","กี่โมง"],
        "responses":["time"]
    },
    {"tag": "date",
        "patterns": ["วันที่เท่าไหร่","วันที่","วันนี้วันอะไร"],
        "responses":["date"]
    },
    {"tag": "month",
        "patterns": ["เดือนนี้เดือนอะไร","เดือน","เดือนนี้","นี่เดือนอะไร","เดือนอะไร"],
        "responses":["month"]
    },
    {"tag": "year",
        "patterns": ["ปีนี้ปีอะไร","ปี","ปีนี้","นี่ปีอะไร","ปีอะไร"],
        "responses":["year"]
    },
    {"tag": "ค่าใช้จ่าย",
        "patterns": ["ค่าใช้จ่ายโดยรวมในปีแรก"],
        "responses":["รายละเอียดค่อนข้างเยอะ กรุณาติดต่อทางงานรับเข้าของคณะวิทย์น่าจะได้ข้อมูลที่ครบถ้วนกว่า โทรศัพท์ 0 4535 3401 หรือ เบอร์ 08 1876 1914"]
    },
    {"tag": "พักหอใน",
        "patterns": ["ปีหนึ่งจำเป็นต้องพักหอในไหม","ปีหนึ่งต้องพักหอในใช่ไหม","ปีแรกบังคับให้พักหอในหรือเปล่า","หอใน"],
        "responses":["ไม่จำเป็น นักศึกษาสามารถจัดหาที่พักได้ด้วยตัวเอง"]

    }
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    


   
    
    
    
    
    
    
    
    
    
   
    
    
    
    
    
    
    
    
    
    
    
    
    
    


]
}